#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.monitoring will be created
  + resource "google_project" "monitoring" {
      + auto_create_network = false
      + effective_labels    = (known after apply)
      + id                  = (known after apply)
      + name                = "Monitoring"
      + number              = (known after apply)
      + org_id              = "org_id"
      + project_id          = "project-id"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)

      + timeouts {}
    }

  # google_project_service.terraform["anthos.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "anthos.googleapis.com"
    }

  # google_project_service.terraform["bigquery.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "bigquery.googleapis.com"
    }

  # google_project_service.terraform["bigquerymigration.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "bigquerymigration.googleapis.com"
    }

  # google_project_service.terraform["bigquerystorage.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "bigquerystorage.googleapis.com"
    }

  # google_project_service.terraform["cloudapis.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "cloudapis.googleapis.com"
    }

  # google_project_service.terraform["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.terraform["cloudtrace.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "cloudtrace.googleapis.com"
    }

  # google_project_service.terraform["compute.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.terraform["connectgateway.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "connectgateway.googleapis.com"
    }

  # google_project_service.terraform["container.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "container.googleapis.com"
    }

  # google_project_service.terraform["datastore.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "datastore.googleapis.com"
    }

  # google_project_service.terraform["dns.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "dns.googleapis.com"
    }

  # google_project_service.terraform["domains.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "domains.googleapis.com"
    }

  # google_project_service.terraform["gkehub.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "gkehub.googleapis.com"
    }

  # google_project_service.terraform["iam.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.terraform["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "iamcredentials.googleapis.com"
    }

  # google_project_service.terraform["logging.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.terraform["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "monitoring.googleapis.com"
    }

  # google_project_service.terraform["servicemanagement.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "servicemanagement.googleapis.com"
    }

  # google_project_service.terraform["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "serviceusage.googleapis.com"
    }

  # google_project_service.terraform["sql-component.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "sql-component.googleapis.com"
    }

  # google_project_service.terraform["storage-api.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "storage-api.googleapis.com"
    }

  # google_project_service.terraform["storage-component.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "storage-component.googleapis.com"
    }

  # google_project_service.terraform["storage.googleapis.com"] will be created
  + resource "google_project_service" "terraform" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "project-id"
      + service                    = "storage.googleapis.com"
    }

Plan: 25 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @TsonasIoannis, Action: `pull_request`, Workflow: `Terraform`*